000002 IDENTIFICATION DIVISION.
000003 PROGRAM-ID. PBEGT004.
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01  WS-WORK-AREA.
000007     03  WS-JUL-DATE     PIC 9(07).
000008     03  WS-INTGR-DATE   PIC 9(07).
000009     03  WS-GREG-DATE    PIC 9(08).
000010     03  WS-GREG         PIC 9(08).
000011     03  WS-GREGX        PIC X(08).
000012     03  WS-INT          PIC 9(09).
000013     03  WS-INT-DATE     PIC 9(08).
000015 PROCEDURE DIVISION.
000016 0000-MAIN.
000017     MOVE 20991231 TO WS-INT-DATE
000018     COMPUTE WS-INT = FUNCTION INTEGER-OF-DATE(WS-INT-DATE)
000019     DISPLAY '1 - DATE :' WS-INT-DATE ' - ' WS-INT
000020     ADD +60 TO WS-INT
000021     COMPUTE WS-GREG-DATE = FUNCTION DATE-OF-INTEGER(WS-INT)
000022     DISPLAY '2 - DATE + 60:' WS-GREG-DATE
000023     COMPUTE WS-JUL-DATE = 2100060
000024     COMPUTE WS-INTGR-DATE = FUNCTION INTEGER-OF-DAY(WS-JUL-DATE)
000025     DISPLAY 'WS-INTGR-DATE:' WS-INTGR-DATE
000026     COMPUTE WS-GREG-DATE =
000027     FUNCTION DATE-OF-INTEGER(WS-INTGR-DATE)
000028     DISPLAY 'WS-GREG-DATE :' WS-GREG-DATE
000031     STOP RUN.
